shadow578/framework-arduino-hc32f46x/cores/arduino/main/init.cpp
#include "init.h"
#include "../drivers/sysclock/sysclock.h"
#include "../drivers/sysclock/systick.h"
#include "../drivers/panic/fault_handlers.h"
#include "../core_debug.h"
#include <hc32_ddl.h>

/**
 * set flash latency and cache
 */
inline void flash_init()
{
    EFM_Unlock();
    EFM_SetLatency(EFM_LATENCY_5);
    EFM_InstructionCacheCmd(Enable);
    EFM_Lock();
}

/**
 * @brief check if the last reset was caused by a
 *        configuration fault (e.g. XTAL fault) that could be reoccuring
 */
inline void check_reoccuring_reset_fault()
{
    // get reset cause
    stc_rmu_rstcause_t cause;
    RMU_GetResetCause(&cause);

    // check for possibly reoccuring faults:
#define CHECK_RSTCAUSE(cause, msg) \
    if (cause == Set)              \
    {                              \
        RMU_ClrResetFlag();        \
        panic(msg);                \
    }

    // - XTAL error, could be caused by a invalid XTAL config or a bad circuit
    CHECK_RSTCAUSE(cause.enXtalErr, "XTAL error, check XTAL config and circuit");
}

void core_init()
{
#if defined(__CC_ARM) && defined(__TARGET_FPU_VFP)
    SCB->CPACR |= 0x00F00000;
#endif

    // setup VTO register
    SCB->VTOR = (uint32_t(LD_FLASH_START) & SCB_VTOR_TBLOFF_Msk);

    // check if last reset could be reoccuring
    check_reoccuring_reset_fault();

    // setup the SoC and initialize drivers
    fault_handlers_init();
    flash_init();
    sysclock_init();
    update_system_clock_frequencies();
    systick_init();
}
